src/Catalogs/СтатьиДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтатьиДоходовИРасходов</Name>
			<Comment>Статьи доходов и расходов</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИРасхода</Name>
					<Comment>Вид дохода и расхода</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондирующий счет бухгалтерского учета для экспорта документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРаспределения</Name>
					<Comment>Статья, на которую по умолчанию распределяется данная статья при закрытии месяца</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьи</Name>
					<Comment>Вид статьи (используется блоком "Бюджетирование")</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатейДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ит_ПричиныВозвратаПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итКонтрольИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиРаспределения</Name>
					<Comment>Статьи распределения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРаспределения</Name>
							<Comment>Статья ДиР, на которую будет произведено перераспределение при закрытии периода</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПользователиРазрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатьиДоходовИРасходов/Ext/ManagerModule.bsl
// Модуль менеджера справочника "СтатьиДоходовИРасходов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Имя, Код, Наименование, ВидДоходаИРасхода, КоррСчет, ВидСтатьи, СтатьяРаспределения.
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрВидДоходаИРасхода = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрКоррСчет = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрВидСтатьи = СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрСтатьяРаспределения = СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		
		// берем предопределенный элемент
		ПредопределеннаяСтатья = Справочники.СтатьиДоходовИРасходов[СтрИмя];
		Если ПредопределеннаяСтатья.Пустая() Тогда
			ВывестиСообщение(НСтр("ru='Ошибка при заполнении справочника: ""%1"". Указан отсутствующий элемент справочника Статьи доходов и расходов.'"),,,,, СтрНаименование);
			Продолжить;
		КонецЕсли;
		ПредопределеннаяСтатьяОбъект = ПредопределеннаяСтатья.ПолучитьОбъект();
		
		// перезаполняем реквизиты
		ПредопределеннаяСтатьяОбъект.Наименование = СтрНаименование;
		
		// Заполняем Вид дохода и расхода
		Если ЗначениеЗаполнено(СтрВидДоходаИРасхода) Тогда
			СсылкаВидДоходаРасхода = Перечисления.ВидыДоходовИРасходов[СтрВидДоходаИРасхода];
			Если СсылкаВидДоходаРасхода.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Виды доходов и расходов: ""%2"" не найден'"),,,,, СтрНаименование, СтрВидДоходаИРасхода);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.ВидДоходаИРасхода) Тогда
					ПредопределеннаяСтатьяОбъект.ВидДоходаИРасхода = СсылкаВидДоходаРасхода;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем Корр. счет
		Если ЗначениеЗаполнено(СтрКоррСчет) Тогда
			СсылкаКоррСчет = ПланыСчетов.Регламентированный.НайтиПоКоду(СтрКоррСчет);
			Если СсылкаКоррСчет.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Корреспондирующий счет: ""%2"" не найден'"),,,,, СтрНаименование, СтрКоррСчет);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.КоррСчет) Тогда
					ПредопределеннаяСтатьяОбъект.КоррСчет = СсылкаКоррСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем Статья распределения
		Если ЗначениеЗаполнено(СтрВидСтатьи) Тогда
			СсылкаВидСтатьиДоходаРасхода = Перечисления.ВидыСтатейДоходовИРасходов[СтрВидСтатьи];
			Если СсылкаВидСтатьиДоходаРасхода .Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Вид статьи дохода расхода: ""%2"" не найдена'"),,,,, СтрНаименование, СтрВидСтатьи);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.ВидСтатьи) Тогда
					ПредопределеннаяСтатьяОбъект.ВидСтатьи = СсылкаВидСтатьиДоходаРасхода;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем табличную часть Статьи распределения
		Если ЗначениеЗаполнено(СтрСтатьяРаспределения) Тогда
			СсылкаСтатьяРаспределения = Справочники.СтатьиДоходовИРасходов[СтрСтатьяРаспределения];
			Если СсылкаСтатьяРаспределения.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Статья распределения: ""%2"" не найдена'"),,,,, СтрНаименование, СтрСтатьяРаспределения);
			Иначе
				Если ПредопределеннаяСтатьяОбъект.СтатьиРаспределения.Найти(СсылкаСтатьяРаспределения, "СтатьяРаспределения") = Неопределено Тогда
					СтрокаСтатьяРаспределения = ПредопределеннаяСтатьяОбъект.СтатьиРаспределения.Добавить();
					СтрокаСтатьяРаспределения.СтатьяРаспределения = СсылкаСтатьяРаспределения;
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
		
		// Сохранение справочника
		НовыйЭлемент = ПредопределеннаяСтатьяОбъект.ЭтоНовый();
		Если ПредопределеннаяСтатьяОбъект.Модифицированность() Тогда
			Попытка
				ПредопределеннаяСтатьяОбъект.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Статьи доходов и расходов"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ПредопределеннаяСтатьяОбъект.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Статьи доходов и расходов""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ВидДоходаИРасхода");
		ОбязательныеРеквизиты.Добавить("КоррСчет");
		ОбязательныеРеквизиты.Добавить("СтатьиРаспределения.СтатьяРаспределения");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
